       01  CP-REC.
           05 CP-CODE      PIC X(3) VALUE "CPY".
           05 CP-QTY       PIC 9(4) COMP-3 VALUE 12.
           05 CP-PRICE     PIC S9(5)V99 VALUE 19.99.
