       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOD1.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-VALUE        PIC S9(9) COMP.
       PROCEDURE DIVISION USING LK-VALUE.
       0000-MOD-MAIN.
           ADD 1 TO LK-VALUE
           GOBACK.
